// videoslot.constants.ts
// Визначення 15 ліній. Кожен масив містить Y-координату (рядок) для кожного з 5 барабанів (X).
export const PAYLINES_CONFIG: Record<number, number[]> = {
  1: [1, 1, 1, 1, 1], // Центральна горизонталь
  2: [0, 0, 0, 0, 0], // Верхня горизонталь
  3: [2, 2, 2, 2, 2], // Нижня горизонталь
  4: [0, 1, 2, 1, 0], // V-подібна вниз
  5: [2, 1, 0, 1, 2], // V-подібна вгору
  6: [0, 0, 1, 2, 2], // Згори донизу
  7: [2, 2, 1, 0, 0], // Знизу догори
  8: [1, 0, 0, 0, 1], // Трапеція верх
  9: [1, 2, 2, 2, 1], // Трапеція низ
  10: [0, 1, 1, 1, 0], // Дуга верх
  11: [2, 1, 1, 1, 2], // Дуга низ
  12: [0, 2, 0, 2, 0], // Зигзаг від верху
  13: [2, 0, 2, 0, 2], // Зигзаг від низу
  14: [1, 0, 1, 2, 1], // Хвиля верх-низ
  15: [1, 2, 1, 0, 1], // Хвиля низ-верх
};

// Множники виплат (Символ -> кількість збігів поспіль зліва направо -> множник)
export const PAYTABLE: Record<number, Record<number, number>> = {
  1: { 3: 5, 4: 20, 5: 100 },  // Символ 1
  2: { 3: 10, 4: 50, 5: 250 }, // Символ 2
  3: { 3: 20, 4: 100, 5: 500 },// Символ 3 (топ)
  4: { 3: 2, 4: 10, 5: 50 },   // Символ 4
  5: { 3: 2, 4: 10, 5: 50 },   // Символ 5
};

export const WILD_SYMBOL = 99; // Замінює будь-який символ
